app/views/urls/index.html.erb

          <td><a href="<%= url.original_url %>" target="_blank"><%=  url.make_url+url.path_for_original_url %></a></td>
          <td><%= url.created_at.strftime("%b %d, %Y") %></td>
---
INSERT INTO "urls" ("created_at", "updated_at", "short_url", "original_url") VALUES ($1, $2, $3, $4) RETURNING "id"