app/controllers/urls_controller.rb

  def index
    @urls = Url.last(10).reverse
---
SELECT "urls".* FROM "urls" ORDER BY "urls"."id" DESC LIMIT $1  [["LIMIT", 10]]

  def url_list
    @urls = Url.last(10).reverse
    @all_clicks = Click.all.reverse
---
SELECT "urls".* FROM "urls" ORDER BY "urls"."id" DESC LIMIT $1  [["LIMIT", 10]]
SELECT "clicks".* FROM "clicks"

  def create
    begin
      original_url = params[:url][:original_url]

      # Create Short URL
      url = shortened_url(original_url) if original_url.present?

      # Checking duplicates
      if url.new_url?
        if url.save
---
SELECT "urls".* FROM "urls" WHERE "urls"."original_url" = $1 LIMIT $2  [["original_url", "https://fullstacklabs.notion.site/Ruby-on-Rails-Coding-Challenge-5d9c09b5edb44fb1bec3aea5c7eb7590"], ["LIMIT", 1]]
SELECT 1 AS one FROM "urls" WHERE "urls"."original_url" = $1 LIMIT $2  [["original_url", "https://relishapp.com/rspec/rspec-rails/docs/model-specs"], ["LIMIT", 1]]
INSERT INTO "urls" ("created_at", "updated_at", "short_url", "original_url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-08-09 12:57:54.464210"], ["updated_at", "2022-08-09 12:57:54.464210"], ["short_url", "HUNCR"], ["original_url", "https://relishapp.com/rspec/rspec-rails/docs/model-specs"]]

  def show
    @url = Url.find_by_short_url params[:url]

    # Fetched Daily Clicks
    create_at = "extract(day from created_at)"
    day_hash = Click.select("#{create_at} as date").group("#{create_at}").count("#{create_at}")
    daily_clicks = Hash[ day_hash.keys.map(&:to_i).zip(day_hash.values) ]
    @daily_clicks = daily_clicks.to_a

    # Fetched Browser Clicks
    @browsers_clicks = Click.group(:browser).count(:browser).to_a

    # Fetched Pltform Clicks
    @platform_clicks = Click.group(:platform).count(:platform).to_a
---
SELECT "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "BFXZQ"], ["LIMIT", 1]]
SELECT COUNT() AS count,  AS  FROM "clicks"
SELECT "clicks".* FROM "clicks" WHERE "clicks"."url_id" = $1  [["url_id", 20]]
SELECT COUNT("clicks"."browser") AS count_browser, "clicks"."browser" AS clicks_browser FROM "clicks" GROUP BY "clicks"."browser"
SELECT COUNT("clicks"."platform") AS count_platform, "clicks"."platform" AS clicks_platform FROM "clicks" GROUP BY "clicks"."platform"

  def create_click
    url = Url.find_by_original_url params['url']
    @url_clicks = url.clicks.new(browser: @browser.name, platform: @browser.platform.name)
    if @url_clicks.save
      url_clicks = url.clicks.count
---
SELECT "urls".* FROM "urls" WHERE "urls"."original_url" = $1 LIMIT $2  [["original_url", "https://jtway.co/how-to-get-build-full-urls-in-rails-99128ef82bc5"], ["LIMIT", 1]]
INSERT INTO "clicks" ("created_at", "updated_at", "url_id", "browser", "platform") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2022-08-09 14:31:43.291170"], ["updated_at", "2022-08-09 14:31:43.291170"], ["url_id", 28], ["browser", "Chrome"], ["platform", "Generic Linux"]]
SELECT COUNT(*) FROM "clicks" WHERE "clicks"."url_id" = $1  [["url_id", 28]]

  def visit
    url = Url.find_by_short_url params[:short_url]
    if url.present?
---
SELECT "urls".* FROM "urls" WHERE "urls"."short_url" = $1 LIMIT $2  [["short_url", "ABCDE"], ["LIMIT", 1]]
SELECT 1 AS one FROM "urls" WHERE "urls"."short_url" = $1 AND "urls"."id" != $2 LIMIT $3  [["short_url", "GNZPK"], ["id", 36], ["LIMIT", 1]]