app/models/url.rb

SELECT "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
SELECT "clicks".* FROM "clicks" WHERE "clicks"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
---
  def find_url_click(click)
    c = Click.find_by_id click[:id]

SELECT "urls".* FROM "urls" WHERE "urls"."original_url" = $1 LIMIT $2  [["original_url", "https://relishapp.com/rspec/rspec-rails/docs/model-specs"], ["LIMIT", 1]]
---
  def find_duplicate
    Url.find_by(original_url: self.original_url)